___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [3]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [5]:
np.sum(df.isna())# sum of na in each row

A    1
B    2
C    0
dtype: int64

In [7]:
sum(df['A'].notna())# sum of not na in A col

2

In [9]:
df.index[df['B'].isna()]#Get index of na

Int64Index([1, 2], dtype='int64')

In [10]:
np.where(df['B'].isna())#Get index of na

(array([1, 2], dtype=int64),)

In [12]:
df.dropna()#Delete all rows that have na

     A    B  C
0  1.0  5.0  1

In [13]:
df.dropna(axis=1)#Delete all columns that have na

   C
0  1
1  2
2  3

In [11]:
df.dropna(thresh=2)# if count of na >2 delete

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [12]:
#Fill values instead of NA in all df
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [13]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [14]:
df.dropna(axis=0,inplace=True)#Delete the missing values (rows) and replace to df
df

     A    B  C
0  1.0  5.0  1

In [4]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df['B'].fillna(value="Not")

0      5
1    Not
2    Not
Name: B, dtype: object

In [ ]:
#Fill values instead of NA in a column.eual above

df.loc[df['Type'].isna(),'Type']='Not Available'#Change the missing values of Type col to a category

# Great Job!